greenhouse-sims/vel212/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    yMinusWall
    {
        type            patch;
        nFaces          924;
        startFace       2616356;
    }
    yPlusWall
    {
        type            patch;
        nFaces          924;
        startFace       2617280;
    }
    inlet
    {
        type            patch;
        nFaces          924;
        startFace       2618204;
    }
    outlet
    {
        type            patch;
        nFaces          924;
        startFace       2619128;
    }
    bottomWall
    {
        type            patch;
        nFaces          36188;
        startFace       2620052;
    }
    topWall
    {
        type            patch;
        nFaces          1936;
        startFace       2656240;
    }
    greenhouse
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          12664;
        startFace       2658176;
    }
)

// ************************************************************************* //
