greenhouse-sims/vel212/0/include/inputs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Rotation angle in degrees

\*---------------------------------------------------------------------------*/

rotAngle 0.0; // degrees
reynoldsNr 36617.3;

// --- do not change below ---
nu #calc "1.0/$reynoldsNr"; // Assumes U=1 and L=1

// ************************************************************************* //
